# EXL_AddSheet

## Description
Add a sheet. If a sheet with this name exists, it will be overwritten.

```pascal
FUNCTION EXL_AddSheet(sheetName : STRING) : BOOLEAN;
```

```python

def vs.EXL_AddSheet(sheetName):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|sheetName|STRING||

## Version
Availability: from Vectorworks 2021
## Category
* Excel